---
kind: property
id: P:Autodesk.Revit.UI.ComboBox.Image
source: html/7bc0f3a6-cd37-7b3a-f7fa-d81cabac4df0.htm
---
# Autodesk.Revit.UI.ComboBox.Image Property

The image shown on the ComboBox.

## Syntax (C#)
```csharp
public ImageSource Image { get; set; }
```

## Remarks
The image will be shown on the left side of the item.
The best size is 16 x 16 pixels.